; domain
(define (domain drone-domain)
    (:requirements :strips :typing :action-costs)
    (:types
        object
        dron caja person transportador - object  ; Corrección de jerarquía de tipos
        location
        content
        num
    )   

    (:functions
        (total-cost)            ; Coste acumulado del plan
        (fly-cost ?from ?to - location)  ; Coste específico entre localizaciones
    )

    (:predicates
        ;; ubicación de drones, cajas, personas y transportadores
        (at ?o - object ?l - location)

        ;; carga en dron
        (en-dron ?c - caja ?d - dron)
        (brazo-libre ?d - dron)

        ;; carga en transportador
        (cajas-en ?t - transportador ?n - num)
        (siguiente-t ?t - transportador ?n1 ?n2 - num)
        (llevado-por ?d - dron ?t - transportador)


        ;; contenidos y necesidades
        (contenido-caja ?c - caja ?t - content)
        (en-transportador ?c - caja ?t - transportador)
        (person-needs ?p - person ?t - content)
        (person-has ?p - person ?t - content)
    )

    ; Acciones
  
    (:action mover-dron
        :parameters (?d - dron ?from - location ?to - location)
        :precondition (at ?d ?from)
        :effect (and
            (not (at ?d ?from))
            (at ?d ?to)
            (increase (total-cost) (fly-cost ?from ?to))
        )
    )
    (:action cargar_dron
        :parameters (?d - dron ?c - caja ?l - location)
        :precondition (and 
            (at ?d ?l)
            (at ?c ?l)
            (brazo-libre ?d)
        )       
        :effect (and
            (not (at ?c ?l))
            (en-dron ?c ?d)
            (not (brazo-libre ?d))
        )
    )

    (:action entregar   
        :parameters (?p - person ?c - caja ?content - content ?l - location ?d - dron)
        :precondition (and 
            (at ?p ?l)
            (at ?d ?l)
            (en-dron ?c ?d)
            (contenido-caja ?c ?content)
            (person-needs ?p ?content)
        )       
        :effect (and
            (not (en-dron ?c ?d))
            (person-has ?p ?content)
            (brazo-libre ?d)
            (not (person-needs ?p ?content))
        )
    )

    (:action poner-caja-en-transportador
        :parameters (?d - dron ?t - transportador ?c - caja ?l - location ?n1 ?n2 - num)
        :precondition (and
            (at ?d ?l)
            (at ?t ?l)
            (en-dron ?c ?d)
            (cajas-en ?t ?n1)
            (siguiente-t ?t ?n1 ?n2)
        )
        :effect (and
            (not (en-dron ?c ?d))
            (not (cajas-en ?t ?n1))
            (cajas-en ?t ?n2)
            (en-transportador ?c ?t)
            (brazo-libre ?d)
        
            
        )
    )
    (:action coger-transportador
        :parameters (?d - dron ?t - transportador ?l - location)
        :precondition (and
            (at ?d ?l)
            (at ?t ?l)
            (brazo-libre ?d)
        )
        :effect (and
            (not (brazo-libre ?d))
            (not (at ?t ?l))
            (llevado-por ?d ?t)
            
        )
    )
    (:action dejar-transportador
        :parameters (?d - dron ?t - transportador ?l - location)
        :precondition (and
            (at ?d ?l)
            (llevado-por ?d ?t)
        )
        :effect (and
            (brazo-libre ?d)
            (not(llevado-por ?d ?t))
            (at ?t ?l)
        )
    )

    (:action mover-transportador
        :parameters (?d - dron ?t - transportador ?from - location ?to - location)
        :precondition (and
            (at ?d ?from)
            (llevado-por ?d ?t)
            
        )
        :effect (and
            (not (at ?d ?from))
            (at ?d ?to)
            (increase (total-cost) (fly-cost ?from ?to))
        )
    )

    (:action sacar-caja-del-transportador
        :parameters (?d - dron ?t - transportador ?c - caja ?l - location ?n1 ?n2 - num)
        :precondition (and
            (at ?t ?l)
            (at ?d ?l)
            (en-transportador ?c ?t)
            (cajas-en ?t ?n2)
            (siguiente-t ?t ?n1 ?n2)
            (brazo-libre ?d)


        )
        :effect (and
            (not (cajas-en ?t ?n2))
            (cajas-en ?t ?n1)
            (not (en-transportador ?c ?t))
            (en-dron ?c ?d)            
            (not (brazo-libre ?d))
            )
    )
)

; problem
(define (problem drone_problem_d1_r1_l2_p2_c2_g2_ct2)
  (:domain drone-domain)
  (:objects
    dron1 - dron
    carrier1 - transportador
    deposito - location
    loc1 - location
    loc2 - location
    crate1 - caja
    crate2 - caja
    comida - content
    medicina - content
    person1 - person
    person2 - person
    n0 - num
    n1 - num
    n2 - num
    n3 - num
    n4 - num
  )

  (:init
    (at dron1 deposito)
    (at carrier1 deposito)
    (at crate1 deposito)
    (at crate2 deposito)
    (contenido-caja crate1 comida)
    (contenido-caja crate2 medicina)
    (at person1 loc2)
    (at person2 loc2)
    (person-needs person1 comida)
    (person-needs person1 medicina)
    (brazo-libre dron1)
    (siguiente-t carrier1 n0 n1)
    (siguiente-t carrier1 n1 n2)
    (siguiente-t carrier1 n2 n3)
    (siguiente-t carrier1 n3 n4)
    (cajas-en carrier1 n0)
	(= (total-cost) 0 )
	(= (fly-cost deposito deposito) 0)
	(= (fly-cost deposito loc1) 236)
	(= (fly-cost deposito loc2) 112)
	(= (fly-cost loc1 deposito) 236)
	(= (fly-cost loc1 loc1) 0)
	(= (fly-cost loc1 loc2) 185)
	(= (fly-cost loc2 deposito) 112)
	(= (fly-cost loc2 loc1) 185)
	(= (fly-cost loc2 loc2) 0)
  )

  (:goal (and
    (at dron1 deposito)
    (person-has person1 comida)
    (person-has person1 medicina)
    (at carrier1 deposito)
  ))

   (:metric minimize (total-cost))

)

; plan
1. (cargar_dron dron1 crate1 deposito)
   deleted: (at crate1 deposito) (brazo-libre dron1)
   added: (en-dron crate1 dron1)
   goals met: 2 of 4
2. (mover-dron dron1 deposito loc1)
   deleted: (at dron1 deposito)
   added: (at dron1 loc1)
   goals met: 1 of 4
3. (mover-dron dron1 loc1 loc2)
   deleted: (at dron1 loc1)
   added: (at dron1 loc2)
   goals met: 1 of 4
4. (entregar person1 crate1 comida loc2 dron1)
   deleted: (en-dron crate1 dron1) (person-needs person1 comida)
   added: (person-has person1 comida) (brazo-libre dron1)
   goals met: 2 of 4
5. (mover-dron dron1 loc2 deposito)
   deleted: (at dron1 loc2)
   added: (at dron1 deposito)
   goals met: 3 of 4
6. (cargar_dron dron1 crate2 deposito)
   deleted: (at crate2 deposito) (brazo-libre dron1)
   added: (en-dron crate2 dron1)
   goals met: 3 of 4
7. (mover-dron dron1 deposito loc2)
   deleted: (at dron1 deposito)
   added: (at dron1 loc2)
   goals met: 2 of 4
8. (entregar person1 crate2 medicina loc2 dron1)
   deleted: (en-dron crate2 dron1) (person-needs person1 medicina)
   added: (person-has person1 medicina) (brazo-libre dron1)
   goals met: 3 of 4
9. (mover-dron dron1 loc2 deposito)
   deleted: (at dron1 loc2)
   added: (at dron1 deposito)
   goals met: 4 of 4
